In [1]:
#Python can read a variety of sources
#CSV
#EXCEL
#HTML
#SQL

In [2]:
#NEED TO INSTALL WITH PIP OR CONDA: - 4 libraries
#conda install sqlalchemy
#conda install lxml
#conda install html5lib
#conda instal BeautifulSoup4

In [2]:
import numpy as np
import pandas as pd

In [3]:
#CSV

In [4]:
#CSV INPUT

In [5]:
pwd

'C:\\Users\\gilma\\Desktop\\Course Data Science\\Refactored_Py_DS_ML_Bootcamp-master\\1 - my archives'

In [2]:
#the file has to be in the same repository as the puthon file

In [6]:
#to read a csv file
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [7]:
#click tab after the underscore to know the variety of files
#that python can read - pd.read_
df = pd.read_csv('example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [8]:
#READING AS EXCEL FILE
#If I dont put index as false it would appear as 'unamed' index
#pandas can read and write excel files
#but can not read formulas, images or macros on Excel 
#anaconda comes with xlrd insalled, but if you are using 
#another terminal, u should have to instal it
df.to_csv('My_output', index=False)

In [9]:
pd.read_csv('My_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [17]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [18]:
df.to_excel('Excel_Sample2.xlsx', sheet_name='NewSheet', index=False)

In [19]:
pd.read_excel('Excel_Sample2.xlsx',sheet_name='NewSheet')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [20]:
#READING HTML FILES
#Pandas can read table tabs off of html. 
data = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [21]:
type(data)

list

In [22]:
data[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020"
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [23]:
data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020"
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"

In [24]:
#Pandas is not the best library to be used with SQL
#There are better engines build to do that

In [25]:
#Do a search for a specific driver to be used for a specife sql engine

In [26]:
#For MySQL there is PyMySQL (another library)

In [27]:
#READING tables in SQL IN PANDAS

In [28]:
from sqlalchemy import create_engine

In [29]:
engine = create_engine('sqlite:///:memory:')
#creates a temporary and smal sqlite engine in the dataframe

In [30]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [31]:
#the 'to' transfers the info for the new file
df.to_sql('my_table', engine)

In [35]:
sqldf = pd.read_sql('my_table', con=engine)

In [36]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15